controllers/SiteController.php

    public function actionView($id)
    {
        $article = Article::findOne($id);
---
SELECT * FROM `article` WHERE `id`='8'

    public function actionArticletag($id)
    {
        $data = Article::getArticlesByTag($id);
        $popular = Article::getPopular();
        $recent = Article::getRecent();
        $categories = Category::getAll();
        $tag = Tag::findOne($id);
---
SELECT * FROM `tag` WHERE `id`='1'