models/ArticleTag.php

SELECT * FROM `article_tag` WHERE `article_id`='8'
SELECT * FROM `tag` WHERE `id` IN (1, 2)
---
     public static function getTags($id)
    {
        $article_tag = ArticleTag::find()->where(['article_id' => $id])->all();
        $tag_ids = [];
        foreach ($article_tag as $at) {
            $tag_ids[] = $at->tag_id;
        }
        $tags = Tag::find()->where(['in','id',$tag_ids])->all();