models/Category.php

    public function getArticlesCount()
    {
        $count = $this->getArticles()->count();
---
SELECT COUNT(*) FROM `article` WHERE `category_id`=1

    public static function getAll()
    {
        $categories = Category::find()->all();
---
SELECT * FROM `category`